### Write a R program to create a data frame from four given vectors?

In [1]:
# First create a vector for emp tables
emp_id = 101:110
emp_name=c("SMITH","ALLEN","CLARK","JOHN","MARTIN","WARD","BLAKE","SCOTT","KING","MILLER")
job=c("CLERK","SALESMAN","MANAGER","MANAGER","SALESMAN","SALESMAN","ANALYST","ANALYST","PRESIDENT","CLERK")
MGR=c(108,107,109,109,107,107,109,103,0,103)
SAL=c(800,1600,1250,1200,1250,1500,2850,3000,5000,1300)
HIREDATE=as.Date(c("1980-02-17","1981-02-20","1981-06-09","1980-04-23","1981-09-28","1981-02-22","1981-05-01","1987-04-19",
                   "1981-11-17","1982-01-23"))

In [2]:
# Create the data frame
emp<-data.frame(emp_id,emp_name,job,MGR,SAL,HIREDATE)
print(emp)

   emp_id emp_name       job MGR  SAL   HIREDATE
1     101    SMITH     CLERK 108  800 1980-02-17
2     102    ALLEN  SALESMAN 107 1600 1981-02-20
3     103    CLARK   MANAGER 109 1250 1981-06-09
4     104     JOHN   MANAGER 109 1200 1980-04-23
5     105   MARTIN  SALESMAN 107 1250 1981-09-28
6     106     WARD  SALESMAN 107 1500 1981-02-22
7     107    BLAKE   ANALYST 109 2850 1981-05-01
8     108    SCOTT   ANALYST 103 3000 1987-04-19
9     109     KING PRESIDENT   0 5000 1981-11-17
10    110   MILLER     CLERK 103 1300 1982-01-23

### Write a R program to extract 3rd and 5th rows with 1st and 3rd columns from a given data frame

In [6]:
emp[c(3,5),c("emp_id","job")]

  emp_id job
3 103    MANAGER
5 105    SALESMAN

### Write a R program to extract specific column from a data frame using column name.

In [5]:
emp[3]

   job
1  CLERK
2  SALESMAN
3  MANAGER
4  MANAGER
5  SALESMAN
6  SALESMAN
7  ANALYST
8  ANALYST
9  PRESIDENT
10 CLERK

###  Write a R program to get the statistical summary and nature of the data of a given data frame.

In [4]:
summary(emp)

     emp_id         emp_name        job         MGR             SAL
 Min.   :101.0   ALLEN  :1   ANALYST  :2   Min.   :  0.0   Min.   : 800
 1st Qu.:103.2   BLAKE  :1   CLERK    :2   1st Qu.:104.0   1st Qu.:1250
 Median :105.5   CLARK  :1   MANAGER  :2   Median :107.0   Median :1400
 Mean   :105.5   JOHN   :1   PRESIDENT:1   Mean   : 96.2   Mean   :1975
 3rd Qu.:107.8   KING   :1   SALESMAN :3   3rd Qu.:108.8   3rd Qu.:2538
 Max.   :110.0   MARTIN :1                 Max.   :109.0   Max.   :5000
                 (Other):4
    HIREDATE
 Min.   :1980-02-17
 1st Qu.:1981-02-20
 Median :1981-05-20
 Mean   :1981-11-05
 3rd Qu.:1981-11-04
 Max.   :1987-04-19

###  Write a R program to drop column(s) by name from a given data frame.

In [3]:
emp[-4] # Temporary

   emp_id emp_name job       SAL  HIREDATE
1  101    SMITH    CLERK      800 1980-02-17
2  102    ALLEN    SALESMAN  1600 1981-02-20
3  103    CLARK    MANAGER   1250 1981-06-09
4  104    JOHN     MANAGER   1200 1980-04-23
5  105    MARTIN   SALESMAN  1250 1981-09-28
6  106    WARD     SALESMAN  1500 1981-02-22
7  107    BLAKE    ANALYST   2850 1981-05-01
8  108    SCOTT    ANALYST   3000 1987-04-19
9  109    KING     PRESIDENT 5000 1981-11-17
10 110    MILLER   CLERK     1300 1982-01-23